{
    "job_id": 3894466400,
    "company_name": "EPAM Systems",
    "job_description": "\nDescription\n\nEPAM is a leading global provider of digital platform engineering and development services. We are committed to having a positive impact on our customers, our employees, and our communities. We embrace a dynamic and inclusive culture. Here you will collaborate with multi-national teams, contribute to a myriad of innovative projects that deliver the most creative and cutting-edge solutions, and have an opportunity to continuously learn and grow. No matter where you are located, you will join a dedicated, creative, and diverse community that will help you discover your fullest potential.\n\nWe are looking for an experienced Senior Data Quality Engineer to join our remote team and lead a project focused on ensuring the accuracy and completeness of data in our organization.\n\nIn this role, you will be responsible for designing, developing, and executing automated tests to validate data quality, as well as identifying and resolving data quality issues. You will work closely with cross-functional teams to ensure that data meets the organization's requirements and standards.\n\nIf you have a passion for data quality and have a proven track record of designing and implementing automated tests, we want to hear from you.\n\n#EasyApply\n\nTechnologies\n\nProgramming Languages: PythonSQL - MSSQL, PostgreSQL, MySQL, OracleBig Data - Hadoop, HDFS, Hive, Spark, Kafka, Flume, SqoopNoSQL – Cassandra, HBase, MongoDBData Visualization: Tableau, Tibco Spotfire, Power BIETL - MS SSIS, Talend, MicroStrategyCloud - AWS/Azure/GCP - Storage; Compute; Networking; Identity and Security; Notebooks; Data CatalogsMDM toolsData GenerationTest Management Tools: TestRail, ZephyrPerformance Testing: JMeterCI/CD principles & tools: JenkinsQueues and Stream processingVersion Control Systems: Git, SVN\n\n\nResponsibilities\n\nBe responsible for data product testing and quality of deliverables on the projectData quality implementation and improving data quality as the main goalEstablish data testing approach and test design, data quality checks across the data lifecycleWork on priorities to achieve better data quality on the project within a tight scheduleDesign and implement data testing strategy concerning system architecture and data flowsPlan and estimate required resources to conduct data product/flow testing and validation concerning company/industry / governmental standardsDesign and develop a data quality framework according to the identified data product strategy (define critical data, controls, and quality targets, set thresholds and alerts, etc.)Understand, design, and implement automated data quality checks\n\n\nRequirements\n\n3+ years of software engineering experience and practice in Data Management, Data Quality verification/Data Governance, Data Visualization testing, Data IntegrationFamiliar with concepts of data ingestion pipelines, and data storage like OLTP databases, Data Warehousing, Data LakesUnderstanding of the ETL process and test strategy for ETLStrong SQL experienceExperience with scripting/automationKnowledge and practical experience in data validationFamiliar with test documentation concepts, such as test strategies, test plans, etcFamiliar with testing methods - TDD, BDT, DDTAnalytical approach to problem-solving; excellent interpersonal and communication skillsExperience in Data analysis & requirements validationData-oriented personality; motivated, independent, efficient, and able to work under pressure with a solid sense for setting prioritiesExperience in direct customer communicationsSkills in infrastructure troubleshooting, support in performance tuning and optimization, bottleneck problem analysisUnderstanding of CI/CD principles\n\n\nNice to have\n\nKnowledge of Java , Scala, Bash, xpathExperience with big data technologies such as Hadoop, Spark, or KafkaFamiliarity with cloud platforms such as AWS, GCP, or AzureCertifications in data quality or software engineering\n Apply\n\n",
    "job_title": "Senior Data Quality Engineer",
    "work_remote_allowed": true,
    "company_apply_url": "https://www.epam.com/careers/job-listings/job.epamgdo_bltc9299cbaddee143a_en-us_Other_Brazil?utm_campaign=LinkedIn_Job_Wrapping&utm_medium=job_slots&utm_source=LinkedIn.com",
    "easy_apply_url": "https://www.linkedin.com/job-apply/3894466400",
    "formatted_location": "Brazil",
    "listed_at": "2024-04-11 23:30:12"
}